[
  {
    "path": "posts/2022-09-19-predicting-dairy-pen-dry-matter-intake-distribution-modnut-2022-presentation/",
    "title": "Predicting dairy pen dry matter intake distribution using machine learning",
    "description": "MODNUT 2022 presentation, Sardini, Italy.",
    "author": [
      {
        "name": "Padraig Lucey",
        "url": "https://www.linkedin.com/in/p%C3%A1draig-lucey-687506124/"
      }
    ],
    "date": "2022-09-19",
    "categories": [],
    "contents": "\n\n\n\n\nPage TitleThis is an embedded Microsoft Office presentation, powered by Office.\n\n\n\nThis is the slideset I presented of my PhD work on a model building process to predict the distribution shape and parameters of dry matter intake for dairy cow pens.\nI gave this presentation at the MODNUT (Modelling Nutrient Digestion and Utilization in Farm Animals) conference in Alghero, Sardinia on the 19th of September 2022.\nThis work focused on the model building process of a machine learning neural network that will predict a distribution type and its parameters after training to a database of simulated cow pens and group level statistics of each pen.\n\n\n\n",
    "preview": "posts/2022-09-19-predicting-dairy-pen-dry-matter-intake-distribution-modnut-2022-presentation/NNscreen.png",
    "last_modified": "2022-09-20T12:59:58+02:00",
    "input_file": {},
    "preview_width": 1704,
    "preview_height": 872
  },
  {
    "path": "posts/2022-08-11-overlaid-plots-in-ggplot2/",
    "title": "Overlaid plots in ggplot2",
    "description": "How to reshape your data and plot the density of repeated measures for easy data visualization",
    "author": [
      {
        "name": "Padraig Lucey",
        "url": "https://www.linkedin.com/in/p%C3%A1draig-lucey-687506124/"
      }
    ],
    "date": "2022-08-09",
    "categories": [],
    "contents": "\nWhen working with variables that have repeated measurements on a\nregular interval it can be useful to visualize how the values change by\nmeasurement. Density plots are a great way of describing a variable and\nlet you quickly visualize how the data is distributed.\nIn biology we usually assume the central limit theorem, that the sum\nof independent random variables tends towards a normal distribution. But\nunderstanding the distribution of a variable of interest, if it assumes\na normal distribution, if there is skew, or if it could be better\ndescribed by an alternate distribution shape can be important\ninformation.\nIn this article I will demonstrate using a sample database how you\ncan appropriately set up your data, then visualize the density plot on\neach level of a repeated variable and how you can easily overlay them\nusing ggplot2 in R Studio. This provides an easy visual assessment of\nthe shape and distribution of your data over time.\nSetting up the data\nThe data I am using includes individual cow records with weekly\nmeasurements of milk yield and feed consumption (DMI as dry matter\nintake) in kilograms. Immediately after a cow gives birth her milk\nproduction and feed requirement quickly increase, but usually the energy\ndemand for milk production exceeds the cows ability to consume enough\nfeed in the first several weeks. Here we will examine and plot the\ndistribution of milk and DMI for this cow group over the first 4 weeks\nof the lactation.\nLoading packages and data\nFor data manipulation I will use the tidyverse package\n\n\nlibrary(tidyverse)\n\n\n\nNext I load, then create a subset of my full dataset with just the\nmeasurements of the weeks of interest.\n\n\nload(\"lact2all.rda\")\ngroup1 <- select(lact2all, CowID, dmi1, dmi2, dmi3, dmi4, milk1, milk2, milk3, milk4) \ngroup1 %>% as_tibble() %>% head()\n\n\n# A tibble: 6 x 9\n  CowID  dmi1  dmi2  dmi3  dmi4 milk1 milk2 milk3 milk4\n  <dbl> <dbl> <dbl> <dbl> <dbl> <dbl> <dbl> <dbl> <dbl>\n1  1546 14.5   14.9 19.1   17.8  22.9  26.6  31.7  31.5\n2  1594 15.7   16.0 17.6   19.9  34.2  35    38.3  42.0\n3  1595 14.0   13.7  9.73  12.0  36.2  34.5  20.8  26.6\n4  1601 17.5   17.5 19.2   17.6  33.9  38.8  43    42.4\n5  1639  9.41  11.7 14.8   15.8  24.1  24.5  28.6  33.6\n6  1640 18.3   18.1 17.6   19.5  21.7  31.9  34.5  38.1\n\nConvert\nthe data to longform with a single column for variable name and\nvalues\nUsing the melt function from the reshape package we can easily make\nthis data set long by pivoting around the unique CowID as our id\nvariable.\n\n\nlibrary(reshape)\nplotdata <- reshape::melt(group1, id=\"CowID\"); \nplotdata %>% group_by(variable) %>% summarise(Cows = n_distinct(CowID))\n\n\n# A tibble: 8 x 2\n  variable  Cows\n  <fct>    <int>\n1 dmi1       316\n2 dmi2       316\n3 dmi3       316\n4 dmi4       316\n5 milk1      316\n6 milk2      316\n7 milk3      316\n8 milk4      316\n\nBuilding a\ndensity plot in ggplot2 and overlaying weeks\nLoading the ggplot2 package we can build a density plot object using\nthe variable column from our melted data set as the fill. Because we\nhave multiple levels of the variable factor (milk1:milk4, dmi1:dmi4)\nthis will create a separate density plot for each. We need to specify it\nas a density plot by adding geom_density to the plot object using\n+ geom_density(alpha=x). The alpha number sets the opacity\nof the color fill of each density plot. Because we expect overlap it is\nsmart to set this number low.\nRemember, when adding elements to a ggplot2 object the +\nmust be entered at the end of your line, not at the beginning of a new\nline.\n\n\nlibrary(ggplot2)\nPlot <- ggplot(plotdata, aes(x=value, fill=variable)) +\n  geom_density(alpha=0.6)\nPlot\n\n\n\n\nNext we can add axes labels to our plot.\n\n\nPlot + labs(title=\"Density of DMI and milk by week\", \n                                 x=\"Kilograms DM\", y=\"Proportion of cows\") \n\n\n\n\nWe can alter the limits of each axis to change where our plot begins\nand ends. I will start the x axis at 5 kg since we know cow’s will not\neat or milk a quantity of 0 kg.\n\n\nPlot + labs(title=\"Density of DMI and milk by week\", \n                                 x=\"Kilograms DM\", y=\"Proportion of cows\") + \n          xlim(5, 65) + ylim(0, 0.13)\n\n\n\n\nFinally we will edit the legend to give appropriate names to the plot\ncolor fills.\n\n\nPlot + labs(title=\"Density of DMI and milk by week\", \n                                 x=\"Kilograms DM\", y=\"Proportion of cows\") + \n          xlim(5, 65) + ylim(0, 0.13) +\n                scale_fill_discrete(name= \"Week\", labels=c(\"DMI 1\", \"DMI 2\", \"DMI 3\", \"DMI 4\",\n                                                                        \"Milk 1\", \"Milk 2\", \"Milk 3\", \"Milk 4\"))\n\n\n\n\nConclusion\nThe result is a graph of the density and distribution of each of our\nvariables at the repeated time points. First using the reshape package\nwe easily converted our data to long form. Then with ggplot2 we created\na density plot object that overlaid the values of each variable by\nmeasurement time point. This produced an easy and useful visualization\nof how the distribution of these variables changed across the time\nperiod of interest for exploring and understanding our data.\n\n\n\n",
    "preview": "posts/2022-08-11-overlaid-plots-in-ggplot2/overlaid-plots-in-ggplot2_files/figure-html5/unnamed-chunk-4-1.png",
    "last_modified": "2022-09-19T12:33:23+02:00",
    "input_file": {},
    "preview_width": 1248,
    "preview_height": 768
  },
  {
    "path": "posts/welcome/",
    "title": "Welcome to Dairy Data Science",
    "description": "Welcome to the site.",
    "author": [
      {
        "name": "Padraig Lucey",
        "url": "https://www.linkedin.com/in/p%C3%A1draig-lucey-687506124/"
      }
    ],
    "date": "2021-10-29",
    "categories": [],
    "contents": "\nApplying data science to Dairy Production\nThis is a website exploring data science in the field of dairy cow production medicine. It will feature short explanations of data visualization and analysis techniques using commercial dairy data.\n\n\n\n",
    "preview": {},
    "last_modified": "2022-09-19T12:33:24+02:00",
    "input_file": {}
  }
]
